In [1]:
import numpy as np
import pandas as pd

In [2]:
gdp=pd.read_csv('gdp-population.csv')
gdp

   City_Name       GDP  Population
0   SHANGHAI  27466.15     2419.70
1    BEIJING  24899.30     2172.90
2  GUANGZHOU  19610.90     1350.11
3   SHENZHEN  19492.60     1137.87
4    TIANJIN  17885.39     1562.12
5  CHONGQING  17558.76     3016.55
6     SUZHOU  15475.09     1375.00
7    CHENGDU  12170.20     1591.76

# 简单的统计运算

In [3]:
city_gdp=gdp.set_index('City_Name')  # 将CityName列设置为index标签索引
city_gdp

                GDP  Population
City_Name
SHANGHAI   27466.15     2419.70
BEIJING    24899.30     2172.90
GUANGZHOU  19610.90     1350.11
SHENZHEN   19492.60     1137.87
TIANJIN    17885.39     1562.12
CHONGQING  17558.76     3016.55
SUZHOU     15475.09     1375.00
CHENGDU    12170.20     1591.76

In [4]:
# pandas的实例中有求一些集中量的函数
city_gdp.sum()  # 求和

GDP           154558.39
Population     14626.01
dtype: float64

In [5]:
city_gdp.mean() # 求平均值

GDP           19319.79875
Population     1828.25125
dtype: float64

In [6]:
city_gdp.median() # 求中位数

GDP           18688.995
Population     1576.940
dtype: float64

In [7]:
# 默认情况下pandas的集合量是沿着0轴计算的
city_gdp.mean(axis=1)  # 设置axis属性控制其沿着1轴计算

City_Name
SHANGHAI     14942.925
BEIJING      13536.100
GUANGZHOU    10480.505
SHENZHEN     10315.235
TIANJIN       9723.755
CHONGQING    10287.655
SUZHOU        8425.045
CHENGDU       6880.980
dtype: float64

In [8]:
city_gdp.loc['XIHONG']=np.nan
city_gdp

                GDP  Population
City_Name
SHANGHAI   27466.15     2419.70
BEIJING    24899.30     2172.90
GUANGZHOU  19610.90     1350.11
SHENZHEN   19492.60     1137.87
TIANJIN    17885.39     1562.12
CHONGQING  17558.76     3016.55
SUZHOU     15475.09     1375.00
CHENGDU    12170.20     1591.76
XIHONG          NaN         NaN

In [9]:
city_gdp.mean()  # 计算时有一个skipna的参数为True默认跳过NaN的数据计算

GDP           19319.79875
Population     1828.25125
dtype: float64

In [10]:
city_gdp.describe()  # describe直接给出各项统计值

                GDP   Population
count      8.000000     8.000000
mean   19319.798750  1828.251250
std     4908.677545   645.654074
min    12170.200000  1137.870000
25%    17037.842500  1368.777500
50%    18688.995000  1576.940000
75%    20933.000000  2234.600000
max    27466.150000  3016.550000

# 分组运算
### 分组对象

In [11]:
df=pd.DataFrame({'subject':['math','physics','english','math','physics','english'],'score':[90,80,70,95,85,75]})
df

   subject  score
0     math     90
1  physics     80
2  english     70
3     math     95
4  physics     85
5  english     75

In [12]:
sub_group=df.groupby('subject')
sub_group  # 分组对象是一个DataFrameGroupBy类型的对象

In [13]:
len(sub_group)

3

In [14]:
hasattr(sub_group,'__iter__')  # 该对象可迭代

True

In [15]:
for k,v in sub_group:  # 看上去是一个有key和value的数据类型
    print(k)
    print(v)

english
   subject  score
2  english     70
5  english     75
math
  subject  score
0    math     90
3    math     95
physics
   subject  score
1  physics     80
4  physics     85

In [16]:
d=dict(list(sub_group))  # 转换为dict类型

In [17]:
d['physics']  # dict通过key获取其value

   subject  score
1  physics     80
4  physics     85

In [18]:
sub_group.get_group('physics')  # 通过get_group方法同样可以获取分组的某个对象

   subject  score
1  physics     80
4  physics     85

### 分组的键

In [19]:
df['teacher']=['Netwon','Netwon','Pascal','Netwon','Pascal','Pascal']
df['rank']=[4,5,2,9,7,5]
df

   subject  score teacher  rank
0     math     90  Netwon     4
1  physics     80  Netwon     5
2  english     70  Pascal     2
3     math     95  Netwon     9
4  physics     85  Pascal     7
5  english     75  Pascal     5

In [20]:
df.groupby('subject').mean()

         score  rank
subject
english   72.5   3.5
math      92.5   6.5
physics   82.5   6.0

In [21]:
df['subject'],type(df['subject'])

(0       math
 1    physics
 2    english
 3       math
 4    physics
 5    english
 Name: subject, dtype: object, pandas.core.series.Series)

In [22]:
df.groupby(df['subject']).mean()  # 需要传入一个Series类型

         score  rank
subject
english   72.5   3.5
math      92.5   6.5
physics   82.5   6.0

In [23]:
df.groupby(['teacher','subject']).mean()  # 指定多列来分组

                 score  rank
teacher subject
Netwon  math      92.5   6.5
        physics   80.0   5.0
Pascal  english   72.5   3.5
        physics   85.0   7.0

In [24]:
df.groupby(['teacher','subject'])['score'].mean()

teacher  subject
Netwon   math       92.5
         physics    80.0
Pascal   english    72.5
         physics    85.0
Name: score, dtype: float64

In [30]:
df.groupby?
# df.groupby(['by=None', 'axis=0', 'level=None', 'as_index=True', 'sort=True', 'group_keys=True', 'squeeze=False', 'observed=False', '**kwargs'],)
# ``by`` : mapping, function, label, or list of labels
# 注意这个by参数就是分组的依据，依据可以传入一个mapping映射，一个函数function，一个列标签名称 label，多个列标签的列表 list of labels

In [31]:
# by参数是mapping
# mapping映射可以是一个dict或者Series
np.random.rand(6,6).shape

(6, 6)

In [32]:
data=pd.DataFrame(np.random.rand(6,6),columns=['a','b','c','d','e','f'],index=['first','second','third','fouth','fifth','sixth'])
data

               a         b         c         d         e         f
first   0.957047  0.000036  0.624755  0.668963  0.698904  0.828384
second  0.066357  0.393742  0.432282  0.581051  0.739212  0.282044
third   0.521661  0.677973  0.434724  0.424103  0.043344  0.910229
fouth   0.519622  0.403659  0.586928  0.585693  0.876123  0.648769
fifth   0.083598  0.172167  0.874663  0.417435  0.753875  0.977851
sixth   0.294313  0.300398  0.247544  0.483296  0.157237  0.700946

In [33]:
# 映射是一个dict
mapping={'a':'one','b':'one','c':'one','d':'two','e':'two','f':'two'}  # 根据1轴上的columns标签索引的名称映射出一个新的分组one和two
for k,v in data.groupby(mapping,axis=1):  # 分组后的样子
    print(k)
    print(v)

one
               a         b         c
first   0.957047  0.000036  0.624755
second  0.066357  0.393742  0.432282
third   0.521661  0.677973  0.434724
fouth   0.519622  0.403659  0.586928
fifth   0.083598  0.172167  0.874663
sixth   0.294313  0.300398  0.247544
two
               d         e         f
first   0.668963  0.698904  0.828384
second  0.581051  0.739212  0.282044
third   0.424103  0.043344  0.910229
fouth   0.585693  0.876123  0.648769
fifth   0.417435  0.753875  0.977851
sixth   0.483296  0.157237  0.700946

In [34]:
data.groupby(mapping,axis=1).sum()

             one       two
first   1.581837  2.196251
second  0.892381  1.602306
third   1.634358  1.377676
fouth   1.510210  2.110586
fifth   1.130428  2.149161
sixth   0.842256  1.341479

In [35]:
# 映射是一个Series
series_map=pd.Series(mapping)
series_map

a    one
b    one
c    one
d    two
e    two
f    two
dtype: object

In [36]:
data.groupby(series_map,axis=1).sum()

             one       two
first   1.581837  2.196251
second  0.892381  1.602306
third   1.634358  1.377676
fouth   1.510210  2.110586
fifth   1.130428  2.149161
sixth   0.842256  1.341479

In [37]:
# 个人关于axis的研究

In [38]:
data

               a         b         c         d         e         f
first   0.957047  0.000036  0.624755  0.668963  0.698904  0.828384
second  0.066357  0.393742  0.432282  0.581051  0.739212  0.282044
third   0.521661  0.677973  0.434724  0.424103  0.043344  0.910229
fouth   0.519622  0.403659  0.586928  0.585693  0.876123  0.648769
fifth   0.083598  0.172167  0.874663  0.417435  0.753875  0.977851
sixth   0.294313  0.300398  0.247544  0.483296  0.157237  0.700946

In [44]:
mapping_2={'first':'front3','second':'front3','third':'front3','fouth':'back3','fifth':'back3','sixth':'back3'}
for k,v in data.groupby(mapping_2): # axis默认为0 其实传入by参数为一个列名称时，也是使用这种类似的映射方式来实现分组的，就是把index索引分组 并为分组起名
    print(k)
    print(v)

back3
              a         b         c         d         e         f
fouth  0.519622  0.403659  0.586928  0.585693  0.876123  0.648769
fifth  0.083598  0.172167  0.874663  0.417435  0.753875  0.977851
sixth  0.294313  0.300398  0.247544  0.483296  0.157237  0.700946
front3
               a         b         c         d         e         f
first   0.957047  0.000036  0.624755  0.668963  0.698904  0.828384
second  0.066357  0.393742  0.432282  0.581051  0.739212  0.282044
third   0.521661  0.677973  0.434724  0.424103  0.043344  0.910229

In [45]:
data.groupby(mapping_2).sum()

               a         b         c         d         e         f
back3   0.897533  0.876225  1.709135  1.486424  1.787235  2.327567
front3  1.545065  1.071750  1.491760  1.674117  1.481460  2.020656

In [46]:
# by参数传入一个函数func
def have_t(name):
    if 't' in name:  # 分组条件
        return 'Have-T'  # 分组1
    else:
        return 'No-T' # 分组2

In [47]:
for k,v in data.groupby(have_t):
    print(k)
    print(v)

Have-T
              a         b         c         d         e         f
first  0.957047  0.000036  0.624755  0.668963  0.698904  0.828384
third  0.521661  0.677973  0.434724  0.424103  0.043344  0.910229
fouth  0.519622  0.403659  0.586928  0.585693  0.876123  0.648769
fifth  0.083598  0.172167  0.874663  0.417435  0.753875  0.977851
sixth  0.294313  0.300398  0.247544  0.483296  0.157237  0.700946
No-T
               a         b         c         d         e         f
second  0.066357  0.393742  0.432282  0.581051  0.739212  0.282044

### 分组对象运算

In [48]:
df

   subject  score teacher  rank
0     math     90  Netwon     4
1  physics     80  Netwon     5
2  english     70  Pascal     2
3     math     95  Netwon     9
4  physics     85  Pascal     7
5  english     75  Pascal     5

In [53]:
df.groupby('teacher').describe()

         rank                                              score             \
        count      mean       std  min  25%  50%  75%  max count       mean
teacher
Netwon    3.0  6.000000  2.645751  4.0  4.5  5.0  7.0  9.0   3.0  88.333333
Pascal    3.0  4.666667  2.516611  2.0  3.5  5.0  6.0  7.0   3.0  76.666667


              std   min   25%   50%   75%   max
teacher
Netwon   7.637626  80.0  85.0  90.0  92.5  95.0
Pascal   7.637626  70.0  72.5  75.0  80.0  85.0

In [54]:
# aggregate
df.groupby('teacher').aggregate(['mean','min','max','median'])  # 如果是多个聚合建议使用aggregate

             score                     rank
              mean min max median      mean min max median
teacher
Netwon   88.333333  80  95     90  6.000000   4   9      5
Pascal   76.666667  70  85     75  4.666667   2   7      5

In [59]:
df.groupby('teacher').median()  # 如果只用一个聚合，建议这样使用

         score  rank
teacher
Netwon      90     5
Pascal      75     5

In [69]:
# 自定义聚合函数
# 自定义的分组函数需要通过aggregate函数传入你的自定义函数来使用
def distance(x):
    return x.max()-x.min()

df.groupby('teacher').aggregate(distance)

         score  rank
teacher
Netwon      15     5
Pascal      15     5

In [73]:
# 上述都是对所有分组的每一项执行同样的分组计算
# pandas可以分别对不同项执行不同的分组计算

df.groupby('teacher').aggregate({'score':['max','mean',distance],'rank':'mean'})  # 通过传入一个dict来映射

        score                          rank
          max       mean distance      mean
teacher
Netwon     95  88.333333       15  6.000000
Pascal     85  76.666667       15  4.666667

In [75]:
# filter
df.groupby('subject').mean()

         score  rank
subject
english   72.5   3.5
math      92.5   6.5
physics   82.5   6.0

In [77]:
for k,v in df.groupby('subject'):
    print(k)
    print(v)

english
   subject  score teacher  rank
2  english     70  Pascal     2
5  english     75  Pascal     5
math
  subject  score teacher  rank
0    math     90  Netwon     4
3    math     95  Netwon     9
physics
   subject  score teacher  rank
1  physics     80  Netwon     5
4  physics     85  Pascal     7

In [80]:
df.groupby('subject').filter(lambda x:x['rank'].mean()>3.5)  # 分组后每个分组的rank>3.5的组内的所有记录保留，其他组全部筛除

   subject  score teacher  rank
0     math     90  Netwon     4
1  physics     80  Netwon     5
3     math     95  Netwon     9
4  physics     85  Pascal     7

In [81]:
df  # filter会返回一个新的对象

   subject  score teacher  rank
0     math     90  Netwon     4
1  physics     80  Netwon     5
2  english     70  Pascal     2
3     math     95  Netwon     9
4  physics     85  Pascal     7
5  english     75  Pascal     5

In [83]:
# transform函数
df.groupby('subject').mean()

         score  rank
subject
english   72.5   3.5
math      92.5   6.5
physics   82.5   6.0

In [84]:
df

   subject  score teacher  rank
0     math     90  Netwon     4
1  physics     80  Netwon     5
2  english     70  Pascal     2
3     math     95  Netwon     9
4  physics     85  Pascal     7
5  english     75  Pascal     5

In [85]:
df.groupby('subject').transform(lambda x:x-x.mean())  # 根据分组运算的结果来修改原始数据的值

   score  rank
0   -2.5  -2.5
1   -2.5  -1.0
2   -2.5  -1.5
3    2.5   2.5
4    2.5   1.0
5    2.5   1.5